RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.3.0_59ac3456/modules/nrfx/drivers/src/nrfx_nfct.c
#ifdef NRF52840_XXAA
/**
 * @brief Internal auxiliary function for checking whether the program is running on the NRF52840 chip.
 *
 * @retval true  It is NRF52480 chip.
 * @retval false It is an other chip.
 */
static inline bool nrfx_nfct_type_52840_check(void)
{
    return ((((*(uint32_t *)0xF0000FE0) & 0xFF) == 0x08) &&
        (((*(uint32_t *)0xF0000FE4) & 0x0F) == 0x0));
}

/**
 * @brief Internal auxiliary function for checking whether the program is running on the first sample of
 *        the nRF52840 chip.
 *
 * @retval true  It is the nRF52480 chip and it is the first sample version.
 * @retval false It is an other chip.
 */
static inline bool nrfx_nfct_type_52840_sample_check(void)
{
    return ( nrfx_nfct_type_52840_check() &&
               ( ((*(uint32_t *)0xF0000FE8) & 0xF0) == 0x00 ) &&
               ( ((*(uint32_t *)0xF0000FEC) & 0xF0) == 0x00 ) );
}

/**
 * @brief Internal auxiliary function for checking whether the program is running on the final version of
 *        the nRF52840 chip.
 *
 * @retval true  It is the nRF52480 chip and it is the final version.
 * @retval false It is an other chip.
 */
static inline bool nrfx_nfct_type_52840_final_check(void)
{
    return ( nrfx_nfct_type_52840_check() &&
              ( ( ((*(uint32_t *)0xF0000FE8) & 0xF0) != 0x00 ) ||
                ( ((*(uint32_t *)0xF0000FEC) & 0xF0) != 0x00 ) ));
}

typedef struct
{
    bool eng_a;  /**< Engineering sample A of the NRF52840 chip. */
    bool eng_bc; /**< Engineering sample B, C of the NRF52840 chip, or its final version. */
} nrfx_nfct_nrf52840_ver_t;

static nrfx_nfct_nrf52840_ver_t m_nrf52840;
#endif // NRF52840_XXAA

/**@brief NFCT control block. */
typedef struct
{
    nrfx_nfct_config_t config;
    nrfx_drv_state_t   state;
    volatile bool      field_on;
} nrfx_nfct_control_block_t;

static nrfx_nfct_control_block_t m_nfct_cb;

/**
 * @brief Common part of the setup used for the NFCT initialization and reinitialization.
 */
static void nrfx_nfct_hw_init_setup(void)
{
#ifdef NRF52840_XXAA
    if (m_nrf52840.eng_a)
    {
        /* Begin: Bugfix for FTPAN-98 */
        *(volatile uint32_t *) 0x4000568C = 0x00038148;
        /* End: Bugfix for FTPAN-98 */
        /* Begin: Bugfix for FTPAN-144 */
        *(volatile uint32_t *) 0x4000561c = 0x01;
        *(volatile uint32_t *) 0x4000562c = 0x3F;
        *(volatile uint32_t *) 0x4000563c = 0x0;
        /* End: Bugfix for FTPAN-144 */
    }
#endif // NRF52840_XXAA

    // Use Window Grid frame delay mode.
    nrf_nfct_frame_delay_mode_set(NRF_NFCT_FRAME_DELAY_MODE_WINDOWGRID);

    /* Begin: Bugfix for FTPAN-25 (IC-9929) */
    /* Workaround for wrong SENSRES values require using SDD00001, but here SDD00100 is used
       because it is required to operate with Windows Phone */
    nrf_nfct_sensres_bit_frame_sdd_set(NRF_NFCT_SENSRES_BIT_FRAME_SDD_00100);
    /* End: Bugfix for FTPAN-25 (IC-9929) */
}

/**@brief Function for evaluating and handling the NFC field events.
 *
 * @param[in]  field_state  Current field state.
 */
static void nrfx_nfct_field_event_handler(volatile nrfx_nfct_field_state_t field_state)
{
    nrfx_nfct_evt_t nfct_evt;

#ifdef NRF52840_XXAA
    if((!m_nrf52840.eng_a) && (m_timer_workaround.fieldevents_filter_active))
    {
        return;
    }
#endif // NRF52840_XXAA

    if (field_state == NRFX_NFC_FIELD_STATE_UNKNOWN)
    {
        /* Probe NFC field */
        field_state = (nrfx_nfct_field_check()) ? NRFX_NFC_FIELD_STATE_ON : NRFX_NFC_FIELD_STATE_OFF;
    }

    /* Field event service */
    switch (field_state)
    {
        case NRFX_NFC_FIELD_STATE_ON:
            if (!m_nfct_cb.field_on)
            {
#ifdef NRF52840_XXAA
                /* Begin: Bugfix for FTPAN-190 */
                if (!m_nrf52840.eng_a)
                {
                    m_timer_workaround.is_hfclk_on               = false;
                    m_timer_workaround.is_delayed                = false;
                    m_timer_workaround.fieldevents_filter_active = true;

                    nrfx_timer_clear(&m_timer_workaround.timer);
                    nrfx_timer_enable(&m_timer_workaround.timer);
                }
                /* END: Bugfix for FTPAN-190 */
#elif defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
                nrfx_timer_clear(&m_timer_workaround.timer);
                nrfx_timer_enable(&m_timer_workaround.timer);
                m_timer_workaround.field_state_cnt = 0;  
#endif // NRF52840_XXAA

                m_nfct_cb.field_on = true;
                nfct_evt.evt_id    = NRFX_NFCT_EVT_FIELD_DETECTED;
                NRFX_NFCT_CB_HANDLE(m_nfct_cb.config.cb, nfct_evt);
            }
            break;

        case NRFX_NFC_FIELD_STATE_OFF:
            nrfx_nfct_state_force(NRFX_NFCT_STATE_SENSING);
#ifdef NRF52840_XXAA
            /* Begin: Bugfix for FTPAN-116 (IC-12886) */
            if (m_nrf52840.eng_a)
            {
                *(volatile uint32_t *)0x40005010 = 1;
            }
            /* END: Bugfix for FTPAN-116 (IC-12886) */
#endif // NRF52840_XXAA
            nrf_nfct_int_disable(NRFX_NFCT_RX_INT_MASK | NRFX_NFCT_TX_INT_MASK);
            m_nfct_cb.field_on = false;
            nfct_evt.evt_id    = NRFX_NFCT_EVT_FIELD_LOST;

            NRFX_NFCT_CB_HANDLE(m_nfct_cb.config.cb, nfct_evt);
            break;

        default:
            /* No implementation required */
            break;
    }
}

#ifdef USE_TIMER_WORKAROUND

#ifdef NRF52840_XXAA
static void nrfx_nfct_activate_check(void)
{
    static bool is_field_validation_pending = false;

    if (is_field_validation_pending)
    {
        is_field_validation_pending                  = false;
        m_timer_workaround.fieldevents_filter_active = false;

        // Check the field status and take action if field is lost.
        nrfx_nfct_field_event_handler(NRFX_NFC_FIELD_STATE_UNKNOWN);
        return;
    }

    if ((m_timer_workaround.is_hfclk_on) && (m_timer_workaround.is_delayed))
    {
        nrf_nfct_task_trigger(NRF_NFCT_TASK_ACTIVATE);
        is_field_validation_pending = true;

        // Start the timer second time to validate whether the tag has locked to the field.
        nrfx_timer_clear(&m_timer_workaround.timer);
        nrfx_timer_enable(&m_timer_workaround.timer);
    }
}
#endif // NRF52840_XXAA

#if defined(NRF52832_XXAA) || defined(NRF52832_XXAB)
static inline void nrfx_nfct_reset(void)
{
    uint32_t                       fdm;
    uint32_t                       int_enabled;
    uint8_t                        nfcid1[NRF_NFCT_SENSRES_NFCID1_SIZE_TRIPLE];
    nrf_nfct_sensres_nfcid1_size_t nfcid1_size;
    nrf_nfct_selres_protocol_t     protocol;

